# 2'. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5])

list = [2, 3, 4, 5, 6]
backIndex = len(list) - 1
startIndex = 0
mult = 0
while startIndex < ((len(list)-1)/2) + 1:
    mult = list[startIndex]*list[backIndex]
    print(f'Перемножение первой пары равно = {mult}')
    startIndex += 1
    backIndex -= 1
